In [2]:
import pandas as pd

In [53]:
df = pd.read_csv("./2010-2023.csv")
df

,BOROUGH,NEIGHBORHOOD,TYPE OF HOME,NUMBER OF SALES,LOWEST SALE PRICE,AVERAGE SALE PRICE,MEDIAN SALE PRICE,HIGHEST SALE PRICE,YEAR
0,MANHATTAN,ALPHABET CITY,01 ONE FAMILY HOMES,1,593362,593362,593362,593362,2010
1,MANHATTAN,ALPHABET CITY,02 TWO FAMILY HOMES,1,1320000,1320000,1320000,1320000,2010
2,MANHATTAN,ALPHABET CITY,03 THREE FAMILY HOMES,1,900000,900000,900000,900000,2010
3,MANHATTAN,CHELSEA,01 ONE FAMILY HOMES,2,500000,2875000,2875000,5250000,2010
4,MANHATTAN,CHELSEA,02 TWO FAMILY HOMES,2,1306213,2603107,2603107,3900000,2010
...,...,...,...,...,...,...,...,...,...
7780,STATEN ISLAND,WESTERLEIGH,03 THREE FAMILY HOMES,1,770000,770000,770000,770000,2022
7781,STATEN ISLAND,WILLOWBROOK,01 ONE FAMILY HOMES,81,249390,742834,730000,1600000,2022
7782,STATEN ISLAND,WILLOWBROOK,02 TWO FAMILY HOMES,42,200000,786202,853000,1160000,2022
7783,STATEN ISLAND,WOODROW,01 ONE FAMILY HOMES,53,340000,660887,649900,1600000,2022
7784,STATEN ISLAND,WOODROW,02 TWO FAMILY HOMES,56,200000,859090,795000,1475000,2022

In [54]:
print(df.columns.tolist())

['BOROUGH', 'NEIGHBORHOOD', 'TYPE OF HOME', 'NUMBER OF SALES', 'LOWEST SALE PRICE', 'AVERAGE SALE PRICE', 'MEDIAN SALE PRICE', 'HIGHEST SALE PRICE', 'YEAR']

In [55]:
borough = df['BOROUGH'].unique()
borough

array(['MANHATTAN', 'BRONX', 'BROOKLYN', 'QUEENS', 'STATEN ISLAND'],
      dtype=object)

In [56]:
grouped = df.groupby(['BOROUGH'])
manhattan = grouped.get_group('MANHATTAN').copy()
manhattan

/var/folders/1g/j5t4q2s518533ryxlrw4rpnm0000gn/T/ipykernel_8572/55429827.py:2: FutureWarning: When grouping with a length-1 list-like, you will need to pass a length-1 tuple to get_group in a future version of pandas. Pass `(name,)` instead of `name` to silence this warning.
  manhattan = grouped.get_group('MANHATTAN').copy()

,BOROUGH,NEIGHBORHOOD,TYPE OF HOME,NUMBER OF SALES,LOWEST SALE PRICE,AVERAGE SALE PRICE,MEDIAN SALE PRICE,HIGHEST SALE PRICE,YEAR
0,MANHATTAN,ALPHABET CITY,01 ONE FAMILY HOMES,1,593362,593362,593362,593362,2010
1,MANHATTAN,ALPHABET CITY,02 TWO FAMILY HOMES,1,1320000,1320000,1320000,1320000,2010
2,MANHATTAN,ALPHABET CITY,03 THREE FAMILY HOMES,1,900000,900000,900000,900000,2010
3,MANHATTAN,CHELSEA,01 ONE FAMILY HOMES,2,500000,2875000,2875000,5250000,2010
4,MANHATTAN,CHELSEA,02 TWO FAMILY HOMES,2,1306213,2603107,2603107,3900000,2010
...,...,...,...,...,...,...,...,...,...
7492,MANHATTAN,UPPER WEST SIDE (79-96),03 THREE FAMILY HOMES,2,4500000,6162500,6162500,7825000,2022
7493,MANHATTAN,WASHINGTON HEIGHTS LOWER,01 ONE FAMILY HOMES,5,950000,1981404,2546506,2546506,2022
7494,MANHATTAN,WASHINGTON HEIGHTS LOWER,02 TWO FAMILY HOMES,10,995000,1870742,1523109,4978192,2022
7495,MANHATTAN,WASHINGTON HEIGHTS LOWER,03 THREE FAMILY HOMES,3,997500,1551335,1110000,2546506,2022
7496,MANHATTAN,WASHINGTON HEIGHTS UPPER,01 ONE FAMILY HOMES,2,1100000,1250000,1250000,1400000,2022

In [57]:
print(mahattan.columns.tolist())

['BOROUGH', 'NEIGHBORHOOD', 'TYPE OF HOME', 'NUMBER OF SALES', 'AVERAGE SALE PRICE', 'MEDIAN SALE PRICE']

In [58]:
manhattan.drop('LOWEST SALE PRICE', axis=1, inplace=True)
manhattan.drop('HIGHEST SALE PRICE', axis=1, inplace=True)
manhattan.drop('YEAR', axis=1, inplace=True)
manhattan

,BOROUGH,NEIGHBORHOOD,TYPE OF HOME,NUMBER OF SALES,AVERAGE SALE PRICE,MEDIAN SALE PRICE
0,MANHATTAN,ALPHABET CITY,01 ONE FAMILY HOMES,1,593362,593362
1,MANHATTAN,ALPHABET CITY,02 TWO FAMILY HOMES,1,1320000,1320000
2,MANHATTAN,ALPHABET CITY,03 THREE FAMILY HOMES,1,900000,900000
3,MANHATTAN,CHELSEA,01 ONE FAMILY HOMES,2,2875000,2875000
4,MANHATTAN,CHELSEA,02 TWO FAMILY HOMES,2,2603107,2603107
...,...,...,...,...,...,...
7492,MANHATTAN,UPPER WEST SIDE (79-96),03 THREE FAMILY HOMES,2,6162500,6162500
7493,MANHATTAN,WASHINGTON HEIGHTS LOWER,01 ONE FAMILY HOMES,5,1981404,2546506
7494,MANHATTAN,WASHINGTON HEIGHTS LOWER,02 TWO FAMILY HOMES,10,1870742,1523109
7495,MANHATTAN,WASHINGTON HEIGHTS LOWER,03 THREE FAMILY HOMES,3,1551335,1110000
7496,MANHATTAN,WASHINGTON HEIGHTS UPPER,01 ONE FAMILY HOMES,2,1250000,1250000

In [59]:
types = manhattan['TYPE OF HOME'].unique()
types

array(['01 ONE FAMILY HOMES', '02 TWO FAMILY HOMES',
       '03 THREE FAMILY HOMES'], dtype=object)

In [61]:
grouped = manhattan.groupby(['TYPE OF HOME'])
one = grouped.get_group('01 ONE FAMILY HOMES').copy()
two = grouped.get_group('02 TWO FAMILY HOMES').copy()
three = grouped.get_group('03 THREE FAMILY HOMES').copy()
one

/var/folders/1g/j5t4q2s518533ryxlrw4rpnm0000gn/T/ipykernel_8572/4036322705.py:2: FutureWarning: When grouping with a length-1 list-like, you will need to pass a length-1 tuple to get_group in a future version of pandas. Pass `(name,)` instead of `name` to silence this warning.
  one = grouped.get_group('01 ONE FAMILY HOMES').copy()
/var/folders/1g/j5t4q2s518533ryxlrw4rpnm0000gn/T/ipykernel_8572/4036322705.py:3: FutureWarning: When grouping with a length-1 list-like, you will need to pass a length-1 tuple to get_group in a future version of pandas. Pass `(name,)` instead of `name` to silence this warning.
  two = grouped.get_group('02 TWO FAMILY HOMES').copy()
/var/folders/1g/j5t4q2s518533ryxlrw4rpnm0000gn/T/ipykernel_8572/4036322705.py:4: FutureWarning: When grouping with a length-1 list-like, you will need to pass a length-1 tuple to get_group in a future version of pandas. Pass `(name,)` instead of `name` to silence this warning.
  three = grouped.get_group('03 THREE FAMILY HOMES').copy()

,BOROUGH,NEIGHBORHOOD,TYPE OF HOME,NUMBER OF SALES,AVERAGE SALE PRICE,MEDIAN SALE PRICE
0,MANHATTAN,ALPHABET CITY,01 ONE FAMILY HOMES,1,593362,593362
3,MANHATTAN,CHELSEA,01 ONE FAMILY HOMES,2,2875000,2875000
6,MANHATTAN,CLINTON,01 ONE FAMILY HOMES,1,3850000,3850000
7,MANHATTAN,EAST VILLAGE,01 ONE FAMILY HOMES,2,5800000,5800000
10,MANHATTAN,GRAMERCY,01 ONE FAMILY HOMES,2,6325000,6325000
...,...,...,...,...,...,...
7485,MANHATTAN,UPPER EAST SIDE (79-96),01 ONE FAMILY HOMES,21,10650618,7521000
7488,MANHATTAN,UPPER WEST SIDE (59-79),01 ONE FAMILY HOMES,4,11226805,8162500
7490,MANHATTAN,UPPER WEST SIDE (79-96),01 ONE FAMILY HOMES,9,11082742,9173800
7493,MANHATTAN,WASHINGTON HEIGHTS LOWER,01 ONE FAMILY HOMES,5,1981404,2546506
7496,MANHATTAN,WASHINGTON HEIGHTS UPPER,01 ONE FAMILY HOMES,2,1250000,1250000